{
    "role": "Sr. Manager",
    "location": "Santa Clara",
    "department": "Product Design",
    "workflow": "CRM & Industry Workflows",
    "company": "ServiceNow",
    "company_description": "It all started in sunny San Diego, California in 2004 when a visionary engineer, Fred Luddy, saw the potential to transform how we work. Fast forward to today - ServiceNow stands as a global market leader, bringing innovative AI-enhanced technology to over 8,100 customers, including 85% of the Fortune 500®. Our intelligent cloud-based platform seamlessly connects people, systems, and processes to empower organizations to find smarter, faster, and better ways to work. But this is just the beginning of our journey. Join us as we pursue our purpose to make the world work better for everyone.",
    "job_description": "At ServiceNow, we embrace representation in and from all professional and personal backgrounds and cultures. This diversity inspires passion and creativity among our teams and propels innovation in our products. This role is part of our Product Design team that uses their superpower of empathizing, understanding, and applying our users' and customers' needs, with the mission to created product experiences they love. Our designers come from a diverse set of skills and background - design systems, visual, interaction, content, and product design. At ServiceNow, design has a very intentional seat at the table, so our team collaborates closely with both engineering and product management from the get-go.",
    "key_responsibilities": [
      "Directly manage, mentor and develop designers on the team",
      "Drive the UX vision and execution of a platform that produces a product line to revolutionize workplace productivity and analytics solutions for some of the largest companies in the world",
      "Collaborate cross-functionally with product management, user research, engineering and content from strategic definition, planning, architecture, through tactical execution of the product roadmaps",
      "Distill complex problems into clear goals and requirements for the design and research team",
      "Drive the growth of user-centric, collaborative culture across the Business Unit",
      "Evangelize design strategy and product vision across the global, distributed design teams",
      "Oversee your team's work: detailed mockups and prototypes and behavior specifications."
    ],
    "basic_qualifications": [
      "Experience in leveraging or critically thinking about how to integrate AI into work processes, decision-making, or problem-solving. This may include using AI-powered tools, automating workflows, analyzing AI-driven insights, or exploring AI's potential impact on the function or industry",
      "BA/BS degree or higher in Design, Design Communication, Human-Computer Interaction, or equivalent combination of education and experience in other related fields",
      "Experience participating in the complete product development lifecycle of web and/or software applications.",
      "Experience in user experience design or industry experience (corporate, software, web or agency)"
    ],
    "preferred_qualifications": [
      "5+ years of experience managing people and/or leading design teams",
      "9+ years of experience in UX Design and/or Interaction Design field",
      "A portfolio of work samples representing your work and approach",
      "Ability to understand and distill complex problems into clean solutions",
      "Must have excellent teamwork, communication, and technical problem-solving skills to contribute within a multi-functional and multi-disciplined team",
      "Obsessed with the relentless pursuit of UX perfection working inside an iterative and agile development environment",
      "Expected to demonstrate a high level of initiative, good sense of humor, and a “make it work” ethos",
      "Experience in creating content and/or designing with compliance to WCAG 2.0/2.1 AA guidelines is a plus"
    ]
  }